::%%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a %%a 

@echo off



cls
echo ===========================================================================
echo                cofface一键刷入recovery工具
echo ===========================================================================
echo               请检查本目录是否有cofface_816w_recovery_20140425.img否则不会成功
echo ===========================================================================
echo          手机按住音量下开机出现英文松手，选择fastboot按电源键，然后连接电脑
echo =========================================================================
echo    一切准备就绪之后点回车直接刷入您的recovery,刷好之后会有提示两个okay,中途切勿取消
echo ===========================================================================

echo 如果你确定您都准备好了,请点任意键继续(点任意键就直接输入)
pause>nul

echo 正在刷入Recovery中，请不要断开USB数据线！！
fastboot flash recovery cofface_816w_recovery_20140425.img
echo 已经成功输入了recovery,欢迎体验
echo 进入HBOOT之后按音量下选择RECOVERY按开机键确认即可进入RECOVERY
echo 点任意键关闭本窗口,
pause>nul

goto end6
